app/Http/Controllers/Frontend/AjaxController.php

insert into `comments` (`parent`, `product_id`, `post_id`, `member_id`, `name`, `email`, `description`, `type`, `created_at`, `updated_at`) values ('0', '50', '', '', 'Bình luận 2', 'quochainina@gmail.com', 'Bình luận 2', 'default', '2018-04-24 14:46:55', '2018-04-24 14:46:55')
---
            $data_insert['created_at'] = new DateTime();
            $data_insert['updated_at'] = new DateTime();

            if(DB::table('comments')->insert($data_insert)){