app/Http/Controllers/Frontend/AjaxController.php

select `A`.`id`, `A`.`code`, `A`.`regular_price`, `A`.`sale_price`, `B`.`title` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `A`.`id` = '10' limit 1
select `A`.*, `B`.`title` from `attributes` as `A` left join `attribute_languages` as `B` on `A`.`id` = `B`.`attribute_id` where `B`.`language` = 'vi' and `A`.`id` = '7' limit 1
---
    public function order($request){
        $valid = Validator::make($request->all(), [
            'name' => 'required',
            'phone' => 'required',
            'email' => 'required|email'
        ], [
            'name.required' => __('validation.required', ['attribute'=>__('site.name')]),
            'phone.required' => __('validation.required', ['attribute'=>__('site.phone')]),
            'email.required' => __('validation.required', ['attribute'=>'Email']),
            'email.email' => __('validation.email', ['attribute'=>'Email']),
        ]);

        $data['type'] = 'danger';
        $data['icon'] = 'warning';

        if ($valid->fails()) {
            $data['message'] = $valid->errors()->first();
            return $data;
        } else {

            $product = DB::table('products as A')
                ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
                ->select('A.id','A.code','A.regular_price','A.sale_price', 'B.title')
                ->where('A.id',$request->product_id)
                ->first();
            $hosting = DB::table('attributes as A')
                ->leftjoin('attribute_languages as B', 'A.id','=','B.attribute_id')
                ->select('A.*','B.title')
                ->where('B.language','vi')
                ->where('A.id',$request->hosting_id)
                ->first();

insert into `orders` (`code`, `name`, `email`, `phone`, `note`, `order_qty`, `subtotal`, `order_price`, `member_id`, `status_id`, `type`, `created_at`, `updated_at`) values ('1530031280', 'Võ Quốc Hải', 'khowebonline@gmail.com', '1679933525', 'Test', '1', '200000', '200000', '', '1', 'online', '2018-06-26 23:41:20', '2018-06-26 23:41:20')
update `orders` set `code` = 'DH00007', `updated_at` = '2018-06-26 23:41:20' where `id` = '7'
insert into `order_details` (`product_id`, `product_title`, `product_code`, `product_qty`, `product_price`, `color_title`, `size_title`, `order_id`) values ('10', 'Erna Doyle', '612', '1', '200000', '1024 MB - 0', '', '7')
---
            $license       = (int)$request->license;

            $total = ($product_price + $hosting_price + $domain_price)*$license;
            $order = Order::create([
                'code'          =>  time(),
                'name'          =>  $request->name,
                'email'         =>  $request->email,
                'phone'         =>  $request->phone,
                'note'          =>  $request->note,
                'order_qty'     =>  $license,
                'subtotal'      =>  floatval($total),
                'order_price'   =>  floatval($total),
                'member_id'     =>  auth()->guard('member')->check() ? auth()->guard('member')->id() : null,
                'status_id'     =>  1,
                'type'          =>  'online',
                'created_at'    => new DateTime(),
                'updated_at'    => new DateTime(),
            ]);
            $order->code = update_code($order->id,'DH');
            $order->save();
            $order->details()->save(new OrderDetail([
                'product_id'    =>  $product->id,
                'product_title' =>  $product->title,
                'product_code'  =>  $product->code,
                'product_qty'   =>  $license,
                'product_price' =>  $product_price,
                'color_title'   =>  $hosting->title.' - '.number_format($hosting_price,0,',','.'),
                'size_title'    =>  $request->domain_name ? $request->domain_name.' - '.number_format($domain_price,0,',','.') : null,
            ]));