app/Http/Controllers/Frontend/CartController.php

    public function tracking(Request $request){
        $this->_data['page_title'] = __('site.tracking');
        $this->_data['breadcrumb'] = '<li> <a href="'.url('/').'">'.__('site.home').'</a> </li>';
        $this->_data['breadcrumb'] .= '<li> '.$this->_data['page_title'].' </li>';
        $this->_data['item'] = Order::where('email',$request->email)->where('code',$request->code)->first();
        if ($this->_data['item'] !== null) {
            $product_id    = explode(',',$this->_data['item']['product_id']);
            $product_code  = explode(',',$this->_data['item']['product_code']);
            $product_size  = explode(',',$this->_data['item']['product_size']);
            $product_color = explode(',',$this->_data['item']['product_color']);
            $product_qty   = explode(',',$this->_data['item']['product_qty']);
            $product_price = explode(',',$this->_data['item']['product_price']);
            $products = [];
            foreach($product_id as $key => $id){
                $product = DB::table('product_languages')
                    ->select('title')
                    ->where('product_id',$id)
                    ->where('language',$this->_data['lang'])
                    ->first();
                $color = DB::table('attribute_languages')
                            ->select('title')
                            ->where('attribute_id',$product_color[$key])
                            ->where('language',$this->_data['lang'])
                            ->first();
                $size = DB::table('attribute_languages')
                            ->select('title')
                            ->where('attribute_id',$product_size[$key])
                            ->where('language',$this->_data['lang'])
                            ->first();
---
select * from `orders` where `email` = 'quochai.coder@gmail.com' and `code` = 'DH00006' limit 1
select `title` from `product_languages` where `product_id` = '47' and `language` = 'vi' limit 1
select `title` from `attribute_languages` where `attribute_id` = '0' and `language` = 'vi' limit 1

    public function checkOut(Request $request){
        $this->_data['page_title'] = __('site.checkout');
        $this->_data['breadcrumb'] = '<li> <a href="'.url('/').'">'.__('site.home').'</a> </li>';
        $this->_data['breadcrumb'] .= '<li> <a href="'.url('/thanh-toan').'"> '.$this->_data['page_title'].' </a> </li>';
        $this->_data['payments'] = DB::table('posts as A')
            ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
            ->select('A.id','A.link','B.title','B.slug','B.description')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type','payment')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();
---
select `A`.`id`, `A`.`link`, `B`.`title`, `B`.`slug`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'payment' order by `A`.`priority` asc, `A`.`id` desc

                $cookieCart = cookie('cart', '', 720);
                $cookieCoupon = cookie('coupon', '', 720);
                if(@config('settings.email_username') !='') Mail::to($order->email)->send(new OrderConfirmation($order));
                return redirect()->route('frontend.cart.thankyou')->with('orderCode', $order->code)->withCookie($cookieCart)->withCookie($cookieCoupon);
---
select * from `coupons` where `code` = '023FB7' and FIND_IN_SET('publish',status) limit 1