app/Http/Controllers/Frontend/CartController.php

select * from `orders` where `email` = 'khowebonline@gmail.com' and `code` = 'DH00005' limit 1
---
    public function tracking(Request $request){
        $this->_data['page_title'] = __('site.tracking');
        $this->_data['breadcrumb'] = '<li> <a href="'.url('/').'">'.__('site.home').'</a> </li>';
        $this->_data['breadcrumb'] .= '<li> '.$this->_data['page_title'].' </li>';
        $this->_data['item'] = Order::where('email',$request->email)->where('code',$request->code)->first();