app/Http/Controllers/Frontend/HomeController.php

    public function index(Request $request){
        $this->_data['new_products'] = DB::table('products as A')
            ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
            ->select('A.id','A.code','A.regular_price','A.sale_price','A.link','A.image','A.alt','A.category_id','A.user_id','A.type','B.title', 'B.slug')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status) AND FIND_IN_SET(\'new\',A.status)')
            ->where('A.type','san-pham')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->limit(8)
            ->get();

        $this->_data['customers'] = DB::table('posts as A')
            ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
            ->select('A.id','A.link','A.image','A.alt','B.title','B.description')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status) and FIND_IN_SET(\'index\',A.status)')
            ->where('A.type','khach-hang')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->limit(5)
            ->get();

        $this->_data['new_posts'] = DB::table('posts as A')
            ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
            ->select('A.id','A.link','A.image','A.alt','A.updated_at','B.title','B.slug','B.description')
            ->where('B.language',$this->_data['lang'])
            ->whereRaw('FIND_IN_SET(\'publish\',A.status) and FIND_IN_SET(\'new\',A.status)')
            ->where('A.type','tin-tuc')
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->limit(3)
            ->get();
---
select `A`.`id`, `A`.`code`, `A`.`regular_price`, `A`.`sale_price`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`category_id`, `A`.`user_id`, `A`.`type`, `B`.`title`, `B`.`slug` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) AND FIND_IN_SET('new',A.status) and `A`.`type` = 'san-pham' order by `A`.`priority` asc, `A`.`id` desc limit 8
select `A`.`id`, `A`.`link`, `A`.`image`, `A`.`alt`, `B`.`title`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and FIND_IN_SET('index',A.status) and `A`.`type` = 'khach-hang' order by `A`.`priority` asc, `A`.`id` desc limit 5
select `A`.`id`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`updated_at`, `B`.`title`, `B`.`slug`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and FIND_IN_SET('new',A.status) and `A`.`type` = 'tin-tuc' order by `A`.`priority` asc, `A`.`id` desc limit 3

    public function category($type,$slug){

        $this->_data['category'] = DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.*', 'B.title', 'B.slug', 'B.meta_seo')
            ->where('B.language', $this->_data['lang'])
            ->where('B.slug',$slug)
            ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
            ->where('A.type',$type)
            ->first();
---
select `A`.*, `B`.`title`, `B`.`slug`, `B`.`meta_seo` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `B`.`language` = 'vi' and `B`.`slug` = 'products' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'uploads' limit 1

                $params['color'] = $request->color;
            }

            $this->_data['products'] = DB::table('products as A')
                ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
                ->select('A.id','A.code','A.regular_price','A.sale_price','A.link','A.image','A.alt','A.category_id','A.user_id','A.type','B.title', 'B.slug')
                ->where('B.language',$this->_data['lang'])
                ->whereRaw($whereRaw)
                ->where('A.type',$type)
                ->orderBy('A.priority','asc')
                ->orderBy('A.id','desc')
                ->paginate(config('settings.product_per_page'));
            $this->_data['products']->withPath( route('frontend.home.archive', $params ) );
            return view('frontend.default.products',$this->_data);
        }elseif($this->_data['template'] == 'post'){
            $this->_data['posts'] = DB::table('posts as A')
                ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
                ->select('A.id','A.link','A.image','A.alt','A.updated_at','B.title','B.slug','B.description')
                ->where('B.language',$this->_data['lang'])
                ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
                ->where('A.type',$type)
                ->orderBy('A.priority','asc')
                ->orderBy('A.id','desc')
                ->paginate(config('settings.post_per_page'));
---
select `A`.`id`, `A`.`code`, `A`.`regular_price`, `A`.`sale_price`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`category_id`, `A`.`user_id`, `A`.`type`, `B`.`title`, `B`.`slug` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'san-pham' order by `A`.`priority` asc, `A`.`id` desc limit 21 offset 0
select count(*) as aggregate from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'san-pham'
select `A`.`id`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`updated_at`, `B`.`title`, `B`.`slug`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'en' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'tin-tuc' order by `A`.`priority` asc, `A`.`id` desc limit 10 offset 0
select count(*) as aggregate from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'en' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'tin-tuc'

    public function page(Request $request, $type,$slug){
        if($this->_data['template'] == 'product'){
            $this->_data['product'] = DB::table('products as A')
                ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
                ->select('A.*','B.title','B.description','B.contents','B.attributes','B.meta_seo')
                ->where('B.language',$this->_data['lang'])
                ->where('B.slug',$slug)
                ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
                ->where('A.type',$type)
                ->first();
            if( $this->_data['product'] ){
                $client_ip = $request->getClientIp();
                if(!Cache::has($client_ip.'_product_view_'.$this->_data['product']->id)){
                    $this->_data['product']->viewed += 1;
                    DB::table('products')->where('id',$this->_data['product']->id)->increment('viewed',1);
                    Cache::add($client_ip.'_product_view_'.$this->_data['product']->id,$this->_data['product']->viewed,5);
                }
                $viewed = is_array($viewed = json_decode($request->cookie('viewed'), true)) ? $viewed : [];
                if( !in_array($this->_data['product']->id,$viewed) ){
                    array_unshift($viewed,$this->_data['product']->id);
                }
                $cookieViewed = cookie('viewed', json_encode($viewed), 1440);

                $this->_data['images'] = get_media($this->_data['product']->attachments);
                $this->_data['attributes'] = $this->_data['product']->attributes ? json_decode($this->_data['product']->attributes,true) : [];
                $this->_data['colors'] = get_attributes('product_colors');
                $this->_data['sizes'] = get_attributes('product_sizes');
                $this->_data['tags'] = get_attributes('product_tags');

                $comments = DB::table('comments')
                    ->where('product_id',$this->_data['product']->id)
                    ->orderBy('parent','asc')
                    ->orderBy('id','desc')
                    ->get();
---
select `A`.*, `B`.`title`, `B`.`description`, `B`.`contents`, `B`.`attributes`, `B`.`meta_seo` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and `B`.`slug` = 'lottie-witting-phd' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'san-pham' limit 1
update `products` set `viewed` = `viewed` + 1 where `id` = '50'
select `A`.*, `B`.`title`, `B`.`description`, `B`.`contents`, `B`.`attributes`, `B`.`meta_seo` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and `B`.`slug` = 'devonte-marks' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'san-pham' limit 1
select * from `comments` where `product_id` = '50' order by `parent` asc, `id` desc

                }
                $this->_data['countComment'] = count($comments);

                $this->_data['products'] = DB::table('products as A')
                    ->leftjoin('product_languages as B', 'A.id', '=', 'B.product_id')
                    ->select('A.id','A.code','A.regular_price','A.sale_price','A.link','A.image','A.alt','A.category_id','A.user_id','A.type','B.title', 'B.slug')
                    ->where('B.language',$this->_data['lang'])
                    ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
                    ->where('A.id','!=',$this->_data['product']->id)
                    ->where('A.category_id',$this->_data['product']->category_id)
                    ->where('A.type',$type)
                    ->orderBy('A.priority','asc')
                    ->orderBy('A.id','desc')
                    ->limit(15)
                    ->get();
                return response()->view('frontend.default.page-product',$this->_data)->cookie($cookieViewed);
            }
        }elseif($this->_data['template'] == 'post'){
            $this->_data['post'] = DB::table('posts as A')
                ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
                ->select('A.*','B.title','B.description','B.contents','B.meta_seo')
                ->where('B.language',$this->_data['lang'])
                ->where('B.slug',$slug)
                ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
                ->where('A.type',$type)
                ->first();
---
select `A`.`id`, `A`.`code`, `A`.`regular_price`, `A`.`sale_price`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`category_id`, `A`.`user_id`, `A`.`type`, `B`.`title`, `B`.`slug` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`id` != '50' and `A`.`category_id` = '1' and `A`.`type` = 'san-pham' order by `A`.`priority` asc, `A`.`id` desc limit 15
select `A`.*, `B`.`title`, `B`.`description`, `B`.`contents`, `B`.`meta_seo` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and `B`.`slug` = 'louvenia-gislason' and FIND_IN_SET('publish',A.status) and `A`.`type` = 'tin-tuc' limit 1

                $client_ip = $request->getClientIp();
                if(!Cache::has($client_ip.'_post_view_'.$this->_data['post']->id)){
                    $this->_data['post']->viewed += 1;
                    DB::table('posts')->where('id',$this->_data['post']->id)->increment('viewed',1);
                    Cache::add($client_ip.'_post_view_'.$this->_data['post']->id,$this->_data['post']->viewed,5);
                }

                $this->_data['author'] = DB::table('users')->select('name')->where( 'id',$this->_data['post']->user_id )->first();

                $this->_data['category'] = DB::table('category_languages')->select('title','slug')->where('language',$this->_data['lang'])
                    ->where('category_id',$this->_data['post']->category_id )->first();

                $comments = DB::table('comments')
                    ->where('post_id',$this->_data['post']->id)
                    ->orderBy('parent','asc')
                    ->orderBy('id','desc')
                    ->get();
---
update `posts` set `viewed` = `viewed` + 1 where `id` = '49'
select `name` from `users` where `id` = '1' limit 1
select `title`, `slug` from `category_languages` where `language` = 'vi' and `category_id` = '1' limit 1
select * from `comments` where `post_id` = '49'

                }
                $this->_data['countComment'] = count($comments);

                $this->_data['posts'] = DB::table('posts as A')
                    ->leftjoin('post_languages as B', 'A.id', '=', 'B.post_id')
                    ->select('A.id','A.link','A.image','A.alt','A.updated_at','B.title','B.slug','B.description')
                    ->where('B.language',$this->_data['lang'])
                    ->whereRaw('FIND_IN_SET(\'publish\',A.status)')
                    ->where('A.id','!=',$this->_data['post']->id)
                    ->where('A.category_id',$this->_data['post']->category_id)
                    ->where('A.type',$type)
                    ->orderBy('A.priority','asc')
                    ->orderBy('A.id','desc')
                    ->limit(15)
                    ->get();
---
select `A`.`id`, `A`.`link`, `A`.`image`, `A`.`alt`, `A`.`updated_at`, `B`.`title`, `B`.`slug`, `B`.`description` from `posts` as `A` left join `post_languages` as `B` on `A`.`id` = `B`.`post_id` where `B`.`language` = 'vi' and FIND_IN_SET('publish',A.status) and `A`.`id` != '49' and `A`.`category_id` = '1' and `A`.`type` = 'tin-tuc' order by `A`.`priority` asc, `A`.`id` desc limit 15