app/Mail/OrderConfirmation.php

select `title` from `product_languages` where `product_id` is null and `language` = 'vi' limit 1
---
    public function build()
    {
        $product_id    = explode(',',$this->order['product_id']);
        $product_code  = explode(',',$this->order['product_code']);
        $product_size  = explode(',',$this->order['product_size']);
        $product_color = explode(',',$this->order['product_color']);
        $product_qty   = explode(',',$this->order['product_qty']);
        $product_price = explode(',',$this->order['product_price']);
        $products = [];
        foreach($product_id as $key => $id){
            $product = DB::table('product_languages')
                ->select('title')
                ->where('product_id',$id)
                ->where('language', 'vi')
                ->first();