app/Http/Controllers/Admin/AttributeController.php

    public function index()
    {
        $this->_data['items'] = DB::table('attributes as A')
            ->leftjoin('attribute_languages as B', 'A.id','=','B.attribute_id')
            ->select('A.*','B.title')
            ->where('A.type',$this->_data['type'])
            ->where('B.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);
---
select `A`.*, `B`.`title` from `attributes` as `A` left join `attribute_languages` as `B` on `A`.`id` = `B`.`attribute_id` where `A`.`type` = 'product_hosting' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `attributes` as `A` left join `attribute_languages` as `B` on `A`.`id` = `B`.`attribute_id` where `A`.`type` = 'product_hosting' and `B`.`language` = 'vi'