app/Http/Controllers/Admin/CategoryController.php

select `A`.*, `B`.`title` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `A`.`priority` > '0' and `A`.`type` = 'san-pham' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `A`.`priority` > '0' and `A`.`type` = 'san-pham' and `B`.`language` = 'vi'
---
    public function index()
    {
        $this->_data['items'] = DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.*','B.title')
            ->where('A.priority','>',0)
            ->where('A.type',$this->_data['type'])
            ->where('B.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);

select `A`.`id`, `A`.`parent`, `B`.`title` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where `A`.`type` = 'san-pham' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc
---
    public function getCategory($type){
        return DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.id', 'A.parent', 'B.title')
            ->where('A.type',$type)
            ->where('B.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();