app/Http/Controllers/Admin/CommentController.php

    public function index(){
        $this->_data['items'] = DB::table('product_languages')
            ->select('title', 'product_id')
            ->whereIn('product_id', DB::table('comments')->pluck('product_id') )
            ->where('language', $this->_data['default_language'])
            ->get();
        foreach( $this->_data['items'] as $key => $item ){
            $this->_data['items'][$key]->sum = DB::table('comments')->where('product_id',$item->product_id)->count();
---
select `title`, `product_id` from `product_languages` where `product_id` in ('50', '50', '50', '50') and `language` = 'vi'
select count(*) as aggregate from `comments` where `product_id` = '50'

    public function ajax(Request $request){
        $comments = DB::table('comments as A')
            ->leftjoin('product_languages as B', 'A.product_id','=','B.product_id')
            ->leftjoin('post_languages as C', 'A.post_id','=','C.post_id')
            ->select('A.*', 'B.title as product_name', 'C.title as post_name')
            ->orWhere('B.language', $this->_data['default_language'])
            ->orWhere('C.language', $this->_data['default_language'])
            ->where('A.type',$this->_data['type'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);
---
select `A`.*, `B`.`title` as `product_name`, `C`.`title` as `post_name` from `comments` as `A` left join `product_languages` as `B` on `A`.`product_id` = `B`.`product_id` left join `post_languages` as `C` on `A`.`post_id` = `C`.`post_id` where `B`.`language` = 'vi' or `C`.`language` = 'vi' and `A`.`type` = 'default' order by `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `comments` as `A` left join `product_languages` as `B` on `A`.`product_id` = `B`.`product_id` left join `post_languages` as `C` on `A`.`post_id` = `C`.`post_id` where `B`.`language` = 'vi' or `C`.`language` = 'vi' and `A`.`type` = 'default'

    public function store(Request $request){
        // dd($request);
        $valid = Validator::make($request->all(), [
            'image'            => 'image|max:2048'
        ], [
            'image.image'               => 'Không đúng chuẩn hình ảnh cho phép',
            'image.max'                 => 'Dung lượng vượt quá giới hạn cho phép là :max KB'
        ]);
        if ($valid->fails()) {
            return redirect()->back()->withErrors($valid)->withInput();
        } else {
            $comment  = new Comment;

            if($request->data){
                foreach($request->data as $field => $value){
                    $comment->$field = $value;
                }
            }

            $comment->priority       = (int)str_replace('.', '', $request->priority);
            $comment->status         = ($request->status) ? implode(',',$request->status) : '';
            $comment->type           = $this->_data['type'];
            $comment->created_at     = new DateTime();
            $comment->updated_at     = new DateTime();
            $comment->save();
            return redirect()->route('admin.comment.index',['type'=>$this->_data['type']])->with('success','Thêm dữ liệu <b>'.$comment->name.'</b> thành công');
---
insert into `comments` (`parent`, `product_id`, `post_id`, `member_id`, `name`, `email`, `description`, `type`, `created_at`, `updated_at`) values ('8', '50', '', '', 'Võ Quốc Hải', 'quochainina@gmail.com', 'Admin trả lời bình luận 2', 'default', '2018-04-28 11:18:17', '2018-04-28 11:18:17')
select * from `comments` where `comments`.`id` = '5' limit 1