app/Http/Controllers/Admin/CommentController.php

select * from `comments` as `A` where `product_id` = '50' and `type` = 'default' order by `priority` asc, `id` desc
---
    public function ajax(Request $request){
        if($request->table == 'products'){
            $items = DB::table('comments as A')
                ->where('product_id',$request->id)
                ->where('type',$this->_data['type'])
                ->orderBy('priority','asc')
                ->orderBy('id','desc')
                ->get();