app/Http/Controllers/Admin/CouponController.php

    public function index(){
        $this->_data['items'] = Coupon::orderBy('priority','asc')->orderBy('id','desc')->paginate(25);
---
select * from `coupons` order by `priority` asc, `id` desc limit 25 offset 0
select count(*) as aggregate from `coupons`