app/Http/Controllers/Admin/OrderController.php

    public function index(){

        $this->_data['items'] = DB::table('orders as A')
            ->where('A.type',$this->_data['type'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);
---
select * from `orders` as `A` where `A`.`type` = 'online' order by `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `orders` as `A` where `A`.`type` = 'online'

            $this->_data['products'] = $products;
            return view('admin.orders.edit',$this->_data);
        }
        return redirect()->route('admin.order.index',['type'=>$this->_data['type']])->with('danger', 'Dữ liệu không tồn tại');
---
select * from `orders` where `orders`.`id` = '1' limit 1

    public function update(Request $request, $id){
        $valid = Validator::make($request->all(), [
            'products'          => 'required',
            ], [
            'products.required' => 'Vui lòng chọn sản phẩm',
        ]);
        if ($valid->fails()) {
            return redirect()->back()->withErrors($valid)->withInput();
        } else {
            $order = Order::find($id);
---
select * from `orders` where `orders`.`id` = '5' limit 1

    public function delete($id){
        $order = Order::find($id);
---
select * from `orders` where `orders`.`id` = '2' limit 1