app/Http/Controllers/Admin/OrderController.php

select sum(order_qty) as qty, sum(order_price) as price from `orders` where `status_id` < '4' and `type` = 'online' limit 1
---
    public function index(){

        $this->_data['items'] = DB::table('orders as A')
            ->where('A.type',$this->_data['type'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);

        $this->_data['total'] = DB::table('orders')
            ->select(DB::raw('sum(order_qty) as qty, sum(order_price) as price'))
            ->where('status_id', '<' , 4)
            ->where('type',$this->_data['type'])->first();