app/Http/Controllers/Admin/ProductController.php

select `A`.*, `B`.`title`, `C`.`title` as `category` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` left join `category_languages` as `C` on `A`.`category_id` = `C`.`category_id` where A.type='san-pham' and `B`.`language` = 'vi' and `C`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` left join `category_languages` as `C` on `A`.`category_id` = `C`.`category_id` where A.type='san-pham' and `B`.`language` = 'vi' and `C`.`language` = 'vi'
---
    public function index(Request $request){
        $whereRaw = "A.type='".$this->_data['type']."'";
        $whereRaw .= $request->category_id ? " and A.category_id=".$request->category_id : "";
        $whereRaw .= $request->title ? " and (A.code like '%".$request->title."%' or B.title like '%".$request->title."%') " : "";
        $whereRaw .= $request->created_at ? " and A.created_at like '%".$request->created_at."%'" : "";
        $whereRaw .= $request->status ? " and FIND_IN_SET('".$request->status."',A.status)" : "";
        $this->_data['oldInput'] = $request->all();
        $this->_data['categories'] = $this->getCategories($this->_data['type']);
        $this->_data['items'] = DB::table('products as A')
            ->leftjoin('product_languages as B', 'A.id','=','B.product_id')
            ->leftjoin('category_languages as C', 'A.category_id','=','C.category_id')
            ->select('A.*','B.title','C.title as category')
            ->whereRaw($whereRaw)
            ->where('B.language', $this->_data['default_language'])
            ->where('C.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);

select `A`.`id`, `A`.`code`, `A`.`original_price` as `price`, `B`.`title` from `products` as `A` left join `product_languages` as `B` on `A`.`id` = `B`.`product_id` where `A`.`code` like '%pro%' or `B`.`title` like '%pro%' and `A`.`type` = 'san-pham' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc
select `A`.`id`, `B`.`title` from `attributes` as `A` left join `attribute_languages` as `B` on `A`.`id` = `B`.`attribute_id` where `A`.`id` in ('3', '2', '1') and `A`.`type` = 'product_colors' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc
select `A`.`id`, `B`.`title` from `attributes` as `A` left join `attribute_languages` as `B` on `A`.`id` = `B`.`attribute_id` where `A`.`id` in ('6', '5', '4') and `A`.`type` = 'product_sizes' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc
---
    public function ajax(Request $request){
        if($request->ajax()){
            $data['items'] = DB::table('products as A')
                ->leftjoin('product_languages as B', 'A.id','=','B.product_id')
                ->select('A.id','A.code','A.original_price as price','B.title')
                ->where('A.type',$request->type)
                ->where('B.language', $this->_data['default_language'])
                ->where('A.code','like', "%$request->q%")
                ->orWhere('B.title','like', "%$request->q%")
                ->orderBy('A.priority','asc')
                ->orderBy('A.id','desc')
                ->get();

            if( $data['items'] !== null ){
                foreach( $data['items'] as $key => $item ){
                    $colors = DB::table('attributes as A')
                                ->leftjoin('attribute_languages as B', 'A.id','=','B.attribute_id')
                                ->select('A.id','B.title')
                                ->whereIn('A.id', DB::table('product_attribute')->where('product_id', $item->id)->where('type','product_colors')->pluck('attribute_id') )
                                ->where('A.type','product_colors')
                                ->where('B.language', $this->_data['default_language'])
                                ->orderBy('A.priority','asc')
                                ->orderBy('A.id','desc')
                                ->get();
                    $sizes = DB::table('attributes as A')
                                ->leftjoin('attribute_languages as B', 'A.id','=','B.attribute_id')
                                ->select('A.id','B.title')
                                ->whereIn('A.id', DB::table('product_attribute')->where('product_id', $item->id)->where('type','product_sizes')->pluck('attribute_id') )
                                ->where('A.type','product_sizes')
                                ->where('B.language', $this->_data['default_language'])
                                ->orderBy('A.priority','asc')
                                ->orderBy('A.id','desc')
                                ->get();

select * from `products` where `products`.`id` = '50' limit 1
---
    public function edit($id){
        $this->_data['item'] = Product::find($id);

select * from `products` where `products`.`id` = '5' limit 1
---
    public function update(Request $request, $id){
        // dd($request);
        $valid = Validator::make($request->all(), [
            'dataL.vi.title' => 'required',
            'code' => 'required|unique:products,code,'.$id,
            'image' => 'image|max:2048',
            'data.category_id' => 'exists:categories,id'
        ], [
            'dataL.vi.title.required'    => 'Vui lòng nhập Tên Sản Phẩm',
            'code.required'   => 'Vui lòng nhập Mã Sản Phẩm',
            'code.unique' => 'Mã sản phẩm đã tồn tại, vui lòng nhập mã khác',
            'image.image' => 'Không đúng chuẩn hình ảnh cho phép',
            'image.max' => 'Dung lượng vượt quá giới hạn cho phép là :max KB',
            'data.category_id.exists' => 'Vui lòng chọn Danh mục',
        ]);
        if ($valid->fails()) {
            return redirect()->back()->withErrors($valid)->withInput();
        } else {
            $product = Product::find($id);

select * from `product_languages` where `product_languages`.`product_id` = '5' and `product_languages`.`product_id` is not null order by `id` asc
---
                $product->save();
                $i = 0;
                foreach($this->_data['languages'] as $lang => $val){
                    $productLang = ProductLanguage::find($product->languages[$i]['id']);

insert into `product_attribute` (`attribute_id`, `product_id`, `type`) values ('3', '5', 'product_colors')
---
                        }
                    }
                }
                $product->attribute()->sync($attrs);

select * from `suppliers` where `type` = 'default' order by `priority` asc, `id` desc
---
    public function getSupplier($type='default'){
        return DB::table('suppliers')
            ->where('type',$type)
            ->orderBy('priority','asc')
            ->orderBy('id','desc')
            ->get();

select `A`.`id`, `A`.`parent`, `B`.`title` from `categories` as `A` left join `category_languages` as `B` on `A`.`id` = `B`.`category_id` where (A.type = 'san-pham' or A.type = 'default') and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc
---
    public function getCategories($type){
        return DB::table('categories as A')
            ->leftjoin('category_languages as B', 'A.id','=','B.category_id')
            ->select('A.id', 'A.parent', 'B.title')
            ->whereRaw('(A.type = \''.$type.'\' or A.type = \'default\')')
            ->where('B.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();

select `A`.*, `B`.`title` from `attributes` as `A` left join `attribute_languages` as `B` on `A`.`id` = `B`.`attribute_id` where `A`.`type` = 'product_colors' and `B`.`language` = 'vi' order by `A`.`priority` asc, `A`.`id` desc
---
    public function getAttributes($type){
        return DB::table('attributes as A')
            ->leftjoin('attribute_languages as B', 'A.id','=','B.attribute_id')
            ->select('A.*','B.title')
            ->where('A.type',$type)
            ->where('B.language', $this->_data['default_language'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->get();

select * from `media_libraries` where `id` in ('') order by `priority` asc, `id` desc
---
    public function getMediaLibrary($attachments){
        $arrID = explode(',',$attachments);
        return MediaLibrary::select('*')->whereIn('id',$arrID)->orderBy('priority','asc')->orderBy('id','desc')->get();