app/Http/Controllers/Admin/UserController.php

    public function index()
    {
    	$this->_data['items'] = User::where('id','!=',1)->orderBy('priority','asc')->orderBy('id','desc')->paginate(25);
---
select count(*) as aggregate from `users` where `id` != '1'