app/Http/Controllers/Admin/WMS_ImportController.php

select `A`.*, `B`.`name` as `username` from `wms_imports` as `A` left join `users` as `B` on `A`.`user_id` = `B`.`id` where `A`.`type` = 'default' order by `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `wms_imports` as `A` left join `users` as `B` on `A`.`user_id` = `B`.`id` where `A`.`type` = 'default'
select sum(import_qty) as qty, sum(import_price) as price from `wms_imports` where FIND_IN_SET('publish',status) and `type` = 'default' limit 1
---
    public function index(){
        $this->_data['items'] = DB::table('wms_imports as A')
            ->leftjoin('users as B', 'A.user_id','=','B.id')
            ->select('A.*','B.name as username')
            ->where('A.type',$this->_data['type'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);

        $this->_data['total'] = DB::table('wms_imports')
            ->select(DB::raw('sum(import_qty) as qty, sum(import_price) as price'))
            ->where('type',$this->_data['type'])->first();