app/Http/Controllers/Admin/WMS_ExportController.php

    public function index(){
        $this->_data['items'] = DB::table('wms_exports as A')
            ->leftjoin('users as B', 'A.user_id','=','B.id')
            ->select('A.*','B.name as username')
            ->where('A.type',$this->_data['type'])
            ->orderBy('A.priority','asc')
            ->orderBy('A.id','desc')
            ->paginate(25);

        $this->_data['total'] = DB::table('wms_exports')
            ->select(DB::raw('sum(export_qty) as qty, sum(export_price) as price'))
            ->where('type',$this->_data['type'])->first();
---
select `A`.*, `B`.`name` as `username` from `wms_exports` as `A` left join `users` as `B` on `A`.`user_id` = `B`.`id` where `A`.`type` = 'default' order by `A`.`priority` asc, `A`.`id` desc limit 25 offset 0
select count(*) as aggregate from `wms_exports` as `A` left join `users` as `B` on `A`.`user_id` = `B`.`id` where `A`.`type` = 'default'
select sum(quantity) as qty, sum(total) as price from `wms_exports` where `type` = 'default' limit 1